Revit 2024 API
AssetProperty.Type Property
Returns the type of the AssetProperty
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public AssetPropertyType Type { get; }
Visual Basic
Public ReadOnly Property Type As AssetPropertyType
	Get
Visual C++
public:
property AssetPropertyType Type {
	AssetPropertyType get ();
}
See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace